app/controllers/annonces_controller.rb

    def show
        @annonce = Annonce.find(params[:id])
        if(current_user)
            @admin = current_user.admin
        else
            @admin = false
        end
        @photos = @annonce.photos
        @first = @photos.first
---
SELECT  "annonces".* FROM "annonces" WHERE "annonces"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."annonce_id" = $1 ORDER BY "photos"."id" ASC LIMIT $2  [["annonce_id", 6], ["LIMIT", 1]]