app/models/annonce.rb

    def self.AlaUne
        Annonce.all.select{ |an| an.AlaUne == true}
---
SELECT "annonces".* FROM "annonces"